import Source from './source';
import Title from './title';


type PostType = {
  title: Title
  number: string
  dedication?: string
  questions?: string[]
  answers?: string[]
  excerpt?: string
  category?: string[]
  body: string[]
  sources: Source[]
}

export default PostType

/*

    {
        "number": "145",
        "title": {
            "sequence": "ג",
            "name": "דיני תחנון",
            "original": "דיני תחנון [ג]"
        },
        "body": [
            "שאלה: ישנם קהילות חסידים שלא אומרים תחנון בימי הסתלקותם של תלמידי הבעש\"ט לדורתם, מה מנהג חב\"ד ומדוע?",
            "תשובה: א. הנה ביחס למנהג זה כתב הרה\"צ בעל המנחת אלעזר ממונקאטש¹: 'והוא מנהג של שטות וקלות, דאם כן לא יאמרו תחנון לעולם, כי אין לך כל יום ויום  שיש בו בעל כרחך יארציי\"ט הרבה מגאונים וקדושים ורבותינו הידועים, ושאינם ידועים, המה הנביאים, תנאים ואמוראים, וכל החכמים וצדיקים בכל הדורות, לאלפים ולרבבות, ויארציי\"ט שלהם בכל יום הנזכר, נמצא בטל תחנון מעיקרו, ושיחסרו כל סימן זה (קל\"א) ח\"ו מהשלחן ערוך. אלא ודאי שזה אינו, וביארציי\"ט אין להחסיר תחנון כלל'.",
            "והניף ידו בשנית בדברי תורה²: 'וגם לאותן שאין אומרים תחנון ביום יא\"צ של צדיק הוא בודאי טעות גמור דאין לך יום בכל השנה שאין בו יא\"צ הרבה של גאוני וקדושי עליון וגם מלהקת נביאים ותנאים ואמוראים זי\"ע ונמצא אתה מוציא לעז על הראשונים כל הצדיקים שאומרים תחנון בכל יום שהוא יומא דהלולא שלהם'.",
            "ב. אלא שבספר משמרת שלום להרה\"צ מקוידינוב³ יישב מנהג זה לחסידים הנוהגים כך על האדמו\"ר שלהם שזכו להסתופף בצילו, והביא מקור למנהג זה, מהגמרא ביבמות⁴ שיום הסתלקותו של צדיק נקרא 'רגל' ולכן אין לומר תחנון, [ולהעיר מהמובא ביחס לאדמו\"ר הרש\"ב⁵: 'ניכר הי' באדמו\"ר נ\"ע שהי' נוח לו אם לא היו אומרים תחנון ביארצייט, וכמו ל\"ג בעומר וכה\"ג']. ",
            "ג. אמנם למעשה מנהגנו עפ\"י דברי אדמו\"ר הצמח צדק, וכך הורה למעשה אדמו\"ר הריי\"צ להקפיד לומר תחנון בימים זכאים כאלו, כפי שמפורש בכו\"כ שיחות ומכתבי הרבי, וכדלקמן: במכתב באג\"ק⁶: 'וע\"ד ששמעתי פעם מכ\"ק מו\"ח אדמו\"ר זצוקללה\"ה נבג\"מ זי\"ע בהנוגע ליום היאצ\"ט שמנהגנו לומר תחנון, שאמר הצמח צדק: ווען איז נאך אזא צייט אויף אויסצובעטין'. [מתי עוד ישנו זמן כזה (מסוגל) לבקש ולפעול].",
            "ובמכתב נוסף⁷: 'במה ששאלני מאז אם נוהגים אצלינו לומר תחנון ביום הסתלקות של צדיקים. הנה בטח ידוע לו שגם ביו\"ד שבט אומרים תחנון, ופעם שאלתי את כ\"ק מו\"ח אדמו\"ר, וענני, ווען איז נאך אזא גוטע צייט אויף אויסבעטען ווי אין די טעג'.",
            "ובשיחת כ' מנחם אב התש\"י⁸: 'שאלתי פעם אצל כ\"ק מו\"ח אדמו\"ר מהו הטעם שאצל חסידי חב\"ד נוהגים לומר תחנון ביאָרצייט של צדיקים (דלא כבפולין), והשיב, שזהו הזמן היותר טוב לבקש ולפעול כו'. ויש לומר הביאור בזה – שאצל פולין אין אומרים תחנון, מפני שהעלי' שביום היאָרצייט אצל הצדיק ש\"באמונתו יְחַי'\" פועלת עלי' אצל כל מקושריו, שנמצאים במעמד ומצב שלמעלה מהענינים שצריכים לומר עליהם תחנון (אף שאין זה בדרך פנימיות); אבל חסידי חב\"ד, שתובעים מהם פנימיות ועבודה דוקא, רוצים להעלות גם את הגוף, גוף רחוץ ('אַ אָפּגעוואַשענעם גוף'), ולכן גם אז אומרים תחנון'.",
            "שאלה: כאשר מישהו מתפלל במנין בו לא אומרים תחנון, שלא כפי מנהג חב\"ד מה עליו לעשות?",
            "תשובה: כתבו הפוסקים שמכיוון שכיום רבו קהילות המתנהגים במנהגים שונים באותה עיר, ע\"כ אין בזה חשש של לא תתגודדו, ולכן ינהג כמנהגנו ויאמר תחנון אך ישתדל לעשות את זה באופן שאינו בולט, וכלשונו של הרבי⁹: 'ובשאלתו השניה [כך שאל השואל: כשמתפלל בבית כנסת שאין אומרים תחנון ביומי' דהילולא שלא לפני מנהגינו, האם להגיד תחנון (שלפעמים זה מעורב בבליטות וויכוחים) או שלא להיות פרוש מן הצבור, ולא להגיד תחנון?] מובן שהנהגה בבליטות, ברובא דרובא אינה רצויה'¹⁰. "
        ],
        "sources": {
            "¹": "נמוקי או\"ח סי' קלא. ",
            "²": "ח\"ג אות מו. ",
            "³": "סימן יב אות ד. ",
            "⁴": "קכב, א וברש\"י שם. ",
            "⁵": "סה\"ש תרצ\"ג ע' 126.  ",
            "⁶": "חי\"ט ע' ריד. ",
            "⁷": "אג\"ק ח\"ז ע' שיא. ",
            "⁸": "לקו\"ש חי\"א ע' 210 (תרגום חופשי). ",
            "⁹": "אג\"ק חט\"ו ע' נח. ",
            "¹⁰": "וראה הדיון בהבנת מענה זה בברורי מנהגים - סדר היום (פרידמן) ע' 139. נתיבים בשדה השליחות ח\"א עמ' לה. גליון התקשרות תש\"נ."
        }
    },


*/